In [ ]:
%load_ext sql
%sql sqlite://

In [ ]:
%%sql CREATE TABLE Students (
  sid CAHR(20),
  name CHAR(30),
  age INTEGER,
  gpa REAL,
  UNIQUE (name, age),
  PRIMARY KEY (sid) 
);

In [ ]:
%%sql INSERT INTO Students 
VALUES 
  (50000, 'Dave', 19, 3.3),
  (53666, 'Jones', 18, 3.4),
  (53688, 'Smith', 18, 3.2),
  (53650, 'Smith', 19, 3.8),
  (53831, 'Madayan', 11, 1.8),
  (53832, 'Guldu', 12, 2.0)

In [ ]:
%sql SELECT * FROM Students;

In [ ]:
%sql PRAGMA foreign_keys = ON

In [ ]:
%%sql CREATE TABLE Enrolled (
  studid CAHR(20),
  cid CHAR(20),
  grade CHAR(10),
  PRIMARY KEY (studid, cid),
  FOREIGN KEY (studid) REFERENCES students (sid)
);

In [ ]:
%%sql
INSERT INTO Enrolled 
VALUES 
  (53666, 'EE102', 'B'),
  (53831, 'CS101', 'C'),
  (53832, 'CS102', 'B'),
  (53650, 'EE101', 'A')

In [ ]:
%%sql
INSERT INTO Enrolled 
VALUES 
  (60000, 'EE102', 'B')

In [11]:
%sql DROP TABLE Enrolled;

 * sqlite://
Done.

[]

In [12]:
%%sql 
CREATE TABLE Enrolled (
  studid CAHR(20),
  cid CHAR(20),
  grade CHAR(10),
  PRIMARY KEY (studid, cid),
  FOREIGN KEY (studid) REFERENCES Students (sid)
    ON DELETE SET NULL
    ON UPDATE CASCADE 
);

 * sqlite://
Done.

[]

In [13]:
%%sql
INSERT INTO Enrolled 
VALUES 
  (53666, 'EE102', 'B'),
  (53831, 'CS101', 'C'),
  (53832, 'CS102', 'B'),
  (53650, 'EE101', 'A')

 * sqlite://
4 rows affected.

[]

In [14]:
%sql SELECT * FROM Enrolled;

 * sqlite://
Done.

[(53666, 'EE102', 'B'),
 (53831, 'CS101', 'C'),
 (53832, 'CS102', 'B'),
 (53650, 'EE101', 'A')]

In [16]:
%%sql
UPDATE Students 
SET sid = 70000
WHERE sid = 53666

 * sqlite://
1 rows affected.

[]

In [17]:
%sql SELECT * FROM Students;

 * sqlite://
Done.

[(50000, 'Dave', 19, 3.3),
 (70000, 'Jones', 18, 3.4),
 (53688, 'Smith', 18, 3.2),
 (53650, 'Smith', 19, 3.8),
 (53831, 'Madayan', 11, 1.8),
 (53832, 'Guldu', 12, 2.0)]

In [18]:
%sql SELECT * FROM Enrolled;

 * sqlite://
Done.

[(70000, 'EE102', 'B'),
 (53831, 'CS101', 'C'),
 (53832, 'CS102', 'B'),
 (53650, 'EE101', 'A')]

In [19]:
%%sql
DELETE 
FROM Students
WHERE sid = 70000;

 * sqlite://
1 rows affected.

[]

In [20]:
%sql SELECT * FROM Enrolled;

 * sqlite://
Done.

[(None, 'EE102', 'B'),
 (53831, 'CS101', 'C'),
 (53832, 'CS102', 'B'),
 (53650, 'EE101', 'A')]

In [21]:
%sql DELETE FROM Enrolled WHERE grade='B'

 * sqlite://
2 rows affected.

[]

In [22]:
%sql SELECT * FROM Enrolled;

 * sqlite://
Done.

[(53831, 'CS101', 'C'), (53650, 'EE101', 'A')]

In [24]:
%%sql
INSERT INTO Enrolled 
VALUES 
  (53832, 'EE102', 'B'),
  (53832, 'CS102', 'B')

 * sqlite://
2 rows affected.

[]

In [25]:
%sql SELECT * FROM Students;

 * sqlite://
Done.

[(50000, 'Dave', 19, 3.3),
 (53688, 'Smith', 18, 3.2),
 (53650, 'Smith', 19, 3.8),
 (53831, 'Madayan', 11, 1.8),
 (53832, 'Guldu', 12, 2.0)]

In [26]:
%sql SELECT * FROM Enrolled;

 * sqlite://
Done.

[(53831, 'CS101', 'C'),
 (53650, 'EE101', 'A'),
 (53832, 'EE102', 'B'),
 (53832, 'CS102', 'B')]

In [28]:
%sql SELECT * FROM Students S, Enrolled E WHERE S.sid = E.studid;

 * sqlite://
Done.

[(53831, 'Madayan', 11, 1.8, 53831, 'CS101', 'C'),
 (53650, 'Smith', 19, 3.8, 53650, 'EE101', 'A'),
 (53832, 'Guldu', 12, 2.0, 53832, 'EE102', 'B'),
 (53832, 'Guldu', 12, 2.0, 53832, 'CS102', 'B')]